src/main/resources/requestWithoutFiltering.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getUserRequestWithoutFiltering>
            <gs:email>janedoe@gmail.com</gs:email>
        </gs:getUserRequestWithoutFiltering>
    </soapenv:Body>
</soapenv:Envelope>